Repository: evelyn046/OmegaT_l10n
Catalog: 2_project/tm/philosophy_EN-US_ZH-CN.tmx
Source language: en_us
Languages: zh_cn

source: The open-source philosophy
zh_cn: 开源的理念

source: OmegaT is an open-source application and project.
zh_cn: OmegaT是开源的应用程序和项目。

source: This means that the source code of the OmegaT program is freely available, and that OmegaT's license gives its users considerable freedom in its use.
zh_cn: 这意味着 OmegaT 的源代码是免费提供的，且 OmegaT 的许可证为其用户提供了极大的使用自由。

source: Not only may it be used free of charge, users are also free to make copies of it and distribute them.
zh_cn: 它不仅可以免费使用，而且用户还可以自由地对其复制和分发。这种自由的一个重要方面是用户也可以修改程序的代码。

source: An important aspect of this freedom is that users may also modify the program's code.
zh_cn: 对于开源运动来说，用户拥有按需修改程序的自由比无需付费更加重要。

source: To the open-source movement, the freedom that users have to change the program to suit their own needs is more important than the fact that they do not have to pay for it. This is described as "free as in speech", in contrast to "free as in beer".
zh_cn: 这被称为“free as in speech（指“自由”，即 free speech（言论自由）中 free 的含义）”，于此相对的是“free as in beer（指“免费”，即 free beer（免费啤酒）中 free 的含义）”。

source: The OmegaT project philosophy
zh_cn: OmegaT 项目理念

source: The same spirit can be found within the OmegaT project.
zh_cn: 在 OmegaT 项目中可以找到相同的精神。

source: Users are free to download and use the program.
zh_cn: 用户可以自由地下载和使用该程序。

source: In turn, they are free, and indeed encouraged (but not obliged in any way) to contribute back to the project.
zh_cn: 反过来，用户可以自由地、并且确实地被鼓励为项目贡献（但没有任何义务）。

source: How they do so is very much up to them.
zh_cn: 用户怎样做取决于他们自己。

source: For example, there is nothing to stop a user writing their own user manual or a demonstration video for OmegaT, and if the project considers it remotely useful, it is likely to be made available to OmegaT's community of users.
zh_cn: 例如，并没有什么东西来阻止用户为 OmegaT 制作自己的用户手册或演示视频，并且，如果项目认为它有长远作用，那么 OmegaT 的用户社区很可能使用它。

source: Where routine tasks are concerned, volunteers working on the OmegaT project are generally given as much freedom as possible in determining the form of their contribution.
zh_cn: 在日常任务方面，从事 OmegaT 项目的志愿者通常会有充分地自由来决定其贡献形式。

source: This hands-off approach is described by the current OmegaT project co-ordinator as "delegated anarchy".
zh_cn: 当前的 OmegaT 项目协调员将这种不干涉的方法称为“授权无政府状态”。

source: In some areas, some degree of co-ordination is required.
zh_cn: 在一些领域，需要一定程度的协调。

source: For example, anyone is free to make changes to OmegaT's program code and to submit these changes to the development team.
zh_cn: 例如，任何人都可以自由地对 OmegaT 的程序代码做出更改，并将这些更改提交给开发团队。

source: Only if they are considered beneficial for OmegaT's users, however, will the development team include them in OmegaT.
zh_cn: 但是，只有当认为它们对 OmegaT 用户有益的情况下，开发团队才会将它们接纳入 OmegaT 中。

source: This ensures that the users' interests are protected, and has also resulted in OmegaT being awarded the Softpedia "100% FREE" guarantee.
zh_cn: 这样可以确保用户的利益得到保护，而又让 OmegaT 被授予 Softpedia“100％ 自由”保证。

source: Development of OmegaT
zh_cn: OmegaT 的开发

source: As elsewhere in the OmegaT project, the work of programming OmegaT is done by volunteers, and in keeping with the project philosophy, the developments and improvements they make to OmegaT are ultimately at their discretion.
zh_cn: 与 OmegaT 项目的其他地方一样，OmegaT 的编程工作由志愿者完成，并且根据项目理念，他们对 OmegaT 的开发和改进最终由他们自己决定。

source: There is however considerable scope within the project for users to suggest improvements and influence the course of future development.
zh_cn: 但是，用户在项目中有相当大空间可以提出改进建议并影响未来的发展进程。

source: The first of these is the OmegaT user group.
zh_cn: 其中首要的是 OmegaT 用户组。

source: This is the main focus of the OmegaT user community.
zh_cn: 这是 OmegaT 用户社区的主要关注点。

source: New users of OmegaT are encouraged to make any suggestions here.
zh_cn: 鼓励 OmegaT 的新用户将各种建议提在这里。

source: One reason for this is that the desired function may already have been implemented, or that there may be reasons why it cannot be implemented.
zh_cn: 原因之一是所需的功能可能已经实现，或者可能由于某些原因而无法实现。

source: Convenient alternative functions or solutions may also exist.
zh_cn: 也可能已经存在方便的替代功能或解决方案。

source: Detailed technical discussion of changes is best conducted directly with OmegaT's developers.
zh_cn: 关于变更的详细技术讨论则最好直接与 OmegaT 的开发人员沟通。

source: For this purpose, a dedicated developers' mailing list exists.
zh_cn: 为此，有一个专门的开发者邮件列表。

source: Once a user has formulated a proposed change or enhancement to OmegaT, a defined procedure exists for its submission to the development team for consideration.
zh_cn: 一旦有用户对 OmegaT 提出了变更或改进建议，便会按一个预定流程将其提交给开发团队进行评估。

source: This enables the numerous suggestions to be managed more easily.
zh_cn: 这样更易于管理大量建议。

source: The procedure is termed an "RFE" (Request for Feature Enhancement) and is managed here.
zh_cn: 此流程称为“RFE”（Request for Feature Enhancement，功能改进建议），在此处管理。

source: Literally hundreds of RFEs have already been made, and many of them already implemented.
zh_cn: 已经建立了数以百计的 RFE，其中有许多已得以实现。

source: However, submission of an RFE does not mean that the desired feature or improvement will automatically be implemented.
zh_cn: 但是，提交 RFE 并不意味着所想要的功能或改进会自动得以实现。

source: Whether or not it is adopted depends firstly upon whether the development team considers it beneficial to OmegaT, and secondly, upon whether one of the developers is willing to do the work of implementing it.
zh_cn: 它是否被采纳首先取决于开发团队是否认为其对 OmegaT 有利，其次则是是否有开发人员愿意来完成其实现工作。

source: OmegaT's developers, who are all volunteers, may be more willing to implement an RFE if the development work is funded by the requester.
zh_cn: 如果请求者对开发工作进行资助，则 OmegaT 的开发人员（他们全部都是志愿者）可能会更愿意去实现某个 RFE。

source: Sponsorship of development has already resulted in the addition of certain features. If you are willing to finance the work of implementing your desired feature, please contact the development team privately for a quotation.
zh_cn: 赞助开发已经促成了一些功能的添加如果您愿意对实现您所需功能的工作进行资助，请私下与开发团队联系来获取报价。

source: It may also be possible for developments commissioned from external developers to be implemented within OmegaT. As with free developments, however, the principle still applies that any changes to OmegaT must be beneficial to the application and its users.
zh_cn: 在 OmegaT 内实现外部开发者所委托的开发也是可能的，虽然是自由开发，但任何对 OmegaT 的更改都必须有益于应用程序及用户的原则依然适用。
